src/Documents/ПеремещениеТоваровОборудования/ПеремещениеТоваровОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваровОборудования</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладах</registerRecords>
  <attributes>
    <name>СкладИсточник</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладНазначение</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыОборудование</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Оборудование</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиНаСкладах/ОстаткиНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Оборудование</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПеремещениеТоваровОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	

	// регистр ОстаткиНаСкладах Приход
	Движения.ОстаткиНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыОборудование Из ТоварыОборудование Цикл
		Движение = Движения.ОстаткиНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = СкладНазначение;
		Движение.Номенклатура = ТекСтрокаТоварыОборудование.Номенклатура;
		Движение.Количество = ТекСтрокаТоварыОборудование.Количество;
	КонецЦикла;

	// регистр ОстаткиНаСкладах Расход
	Движения.ОстаткиНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыОборудование Из ТоварыОборудование Цикл
		Движение = Движения.ОстаткиНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = СкладИсточник;
		Движение.Номенклатура = ТекСтрокаТоварыОборудование.Номенклатура;
		Движение.Количество = ТекСтрокаТоварыОборудование.Количество;
	КонецЦикла;

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиНаСкладахОстатки.Склад КАК Склад,
		|	ОстаткиНаСкладахОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладах.Остатки(
		|			,
		|			Склад = &Склад
		|				И Номенклатура В (&Товары)) КАК ОстаткиНаСкладахОстатки
		|ГДЕ
		|	ОстаткиНаСкладахОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", СкладИсточник);
	Запрос.УстановитьПараметр("Товары", ТоварыОборудование.ВыгрузитьКолонку("Номенклатура"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("На складе " + ВыборкаДетальныеЗаписи.Склад+" не хватает	"+ ВыборкаДетальныеЗаписи.Номенклатура);
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры
